% [9, 2, 3]
number9 = [-1 -1 -1 -1 +1 +1 +1 +1 +1 +1;
           -1 -1 -1 -1 +1 +1 +1 +1 +1 +1;
           -1 -1 -1 -1 +1 +1 -1 -1 +1 +1;
           -1 -1 -1 -1 +1 +1 -1 -1 +1 +1;
           -1 -1 -1 -1 +1 +1 -1 -1 +1 +1;
           -1 -1 -1 -1 +1 +1 -1 -1 +1 +1;
           -1 -1 -1 -1 +1 +1 +1 +1 +1 +1;
           -1 -1 -1 -1 +1 +1 +1 +1 +1 +1;
           -1 -1 -1 -1 -1 -1 -1 -1 +1 +1;
           -1 -1 -1 -1 -1 -1 -1 -1 +1 +1;
           -1 -1 -1 -1 +1 +1 +1 +1 +1 +1;
           -1 -1 -1 -1 +1 +1 +1 +1 +1 +1];
       
number2 = [+1 +1 +1 +1 +1 +1 +1 +1 -1 -1;
           +1 +1 +1 +1 +1 +1 +1 +1 -1 -1;
           -1 -1 -1 -1 -1 -1 +1 +1 -1 -1;
           -1 -1 -1 -1 -1 -1 +1 +1 -1 -1;
           -1 -1 -1 -1 -1 -1 +1 +1 -1 -1;
           +1 +1 +1 +1 +1 +1 +1 +1 -1 -1;
           +1 +1 +1 +1 +1 +1 +1 +1 -1 -1;
           +1 +1 -1 -1 -1 -1 -1 -1 -1 -1;
           +1 +1 -1 -1 -1 -1 -1 -1 -1 -1;
           +1 +1 -1 -1 -1 -1 -1 -1 -1 -1;
           +1 +1 +1 +1 +1 +1 +1 +1 -1 -1;
           +1 +1 +1 +1 +1 +1 +1 +1 -1 -1];
     
number3 = [-1 -1 +1 +1 +1 +1 +1 +1 -1 -1;
           -1 -1 +1 +1 +1 +1 +1 +1 +1 -1;
           -1 -1 -1 -1 -1 -1 -1 +1 +1 -1;
           -1 -1 -1 -1 -1 -1 -1 +1 +1 -1;
           -1 -1 -1 -1 -1 -1 -1 +1 +1 -1;
           -1 -1 -1 -1 +1 +1 +1 +1 -1 -1;
           -1 -1 -1 -1 +1 +1 +1 +1 -1 -1;
           -1 -1 -1 -1 -1 -1 -1 +1 +1 -1;
           -1 -1 -1 -1 -1 -1 -1 +1 +1 -1;
           -1 -1 -1 -1 -1 -1 -1 +1 +1 -1;
           -1 -1 -1 +1 +1 +1 +1 +1 +1 -1;
           -1 -1 -1 +1 +1 +1 +1 +1 -1 -1];

       
% 2.1
% Инициализация сети
P = [number9(:), number2(:), number3(:)];
net = newhop(P);
view(net);

% 2.2
% Расчет выхода и подача исходного образа
iterations = 600;
R = sim(net, {1 iterations}, {}, number2(:));
R = reshape(R{iterations}, 12, 10);
R(R >=0 ) = 2;
R(R < 0 ) = 1;

map = [1, 1, 1; 0, 0, 0];
image(R);
colormap(map)
axis off
axis image

% 2.3
% Зашумление 20%
r = rand([12, 10]);
M = 0.2;
in = number9;
for i=1:12
    for j = 1:10
        if r(i,j) < M
            in(i,j) = -in(i,j);
        end
    end
end

% Вывод образа
R = reshape(in, 12, 10);
R(R >= 0) = 2;
R(R < 0) = 1;
map = [1, 1, 1; 0, 0, 0];
figure('Name', '9');
image(R);
colormap(map)
axis off
axis image

% Распознавание
iterations = 600;
R = sim(net, {1 iterations},  {}, in(:));
R = reshape(R{iterations}, 12, 10);
R(R >=0 ) = 2;
R(R < 0 ) = 1;
map = [1, 1, 1; 0, 0, 0];
figure;
image(R);
colormap(map)
axis off
axis image

% 2.4
% Зашумление 30%
r = rand([12, 10]);
M = 0.3;
in = number2;
for i=1:12
    for j = 1:10
        if r(i,j) < M
            in(i,j) = -in(i,j);
        end
    end
end

% Вывод образа
R = reshape(in, 12, 10);
R(R >= 0) = 2;
R(R < 0) = 1;
map = [1, 1, 1; 0, 0, 0];
figure('Name', '2');
image(R);
colormap(map)
axis off
axis image

% Распознавание
iterations = 600;
R = sim(net, {1 iterations},  {}, in(:));
R = reshape(R{iterations}, 12, 10);
R(R >=0 ) = 2;
R(R < 0 ) = 1;
map = [1, 1, 1; 0, 0, 0];
figure;
image(R);
colormap(map)
axis off
axis image